10/data/attachments/bd72285cc5b2ec7e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_40c31c0a-1c15-4e2c-8db7-8b846de2efc4</nif:username>
            <nif:friendToBeAdded>Nicholas_maybe_Actions_33046_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>